app/controllers/members_controller.rb

INSERT INTO "buildings" ("name", "registered_year", "email", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Diamond Tower"], ["registered_year", nil], ["email", nil], ["address", nil], ["created_at", "2022-01-10 17:43:13.930868"], ["updated_at", "2022-01-10 17:43:13.930868"]]
INSERT INTO "members" ("room_no", "name", "mobile", "purchase_year", "building_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @building = Building.create name: "Diamond Tower"
    @member = @building.members.build(member_params)
    if @member.save!

SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "members" SET "purchase_year" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["purchase_year", "2023"], ["updated_at", "2022-01-10 17:01:55.772245"], ["id", 1]]
---
  def update
    @member = Member.find(params[:id])
    if @member.update(member_params)